[
  {
    "id": "82e0687b-dd37-43c6-8cd1-de14acb7ff94",
    "patientId": "TB-2025-001",
    "date": "2025-12-17",
    "type": "Patient Diagnosis",
    "status": "treatment",
    "result": "Selamat siang. TBNow akan membantu Anda dalam melakukan penilaian risiko dan merekomendasikan langkah diagnostik untuk pasien ini, berdasarkan informasi yang diberikan dan pedoman yang relevan.\n\n### Penilaian Risiko\n\nPasien berusia 15 tahun ini menunjukkan beberapa gejala yang memerlukan perhatian terkait kemungkinan Tuberkulosis (TB), terutama mengingat usianya yang masih dalam kategori remaja dan dapat menerapkan sebagian kriteria diagnosis TB pada anak:\n\n*   **Gejala Khas TB:** Pasien mengeluhkan batuk selama 2 minggu dan demam (39 C). Berdasarkan pedoman diagnosis TB anak (halaman 93), batuk yang lama atau persisten (> 2 minggu) dan demam lama (> 2 minggu) dan/atau berulang tanpa sebab yang jelas merupakan gejala sistemik/umum TB pada anak. Durasi batuk pasien (2 minggu) dan adanya demam, walaupun belum dipastikan demamnya persisten > 2 minggu, sudah memenuhi kriteria awal untuk kecurigaan TB.\n*   **Riwayat Kontak:** Pasien tidak memiliki riwayat kontak yang jelas dengan pasien TB paru dewasa. Meskipun riwayat kontak penting dalam penilaian risiko, ketiadaan riwayat kontak tidak mengeksklusi kemungkinan TB, terutama di area dengan prevalensi TB yang tinggi.\n*   **Komorbiditas:** Kondisi asam lambung yang disebutkan tidak secara langsung berkaitan dengan risiko TB, namun penting untuk dicatat dalam riwayat medis umum pasien.\n*   **Kesimpulan Risiko:** Mengingat adanya gejala batuk persisten dan demam yang konsisten dengan gejala awal TB pada kelompok usia ini, pasien memiliki risiko **menengah hingga tinggi** untuk TB dan memerlukan evaluasi diagnostik lebih lanjut.\n\n### Rekomendasi Diagnosis\n\nBerdasarkan gejala yang dialami pasien dan usianya (15 tahun, yang umumnya memungkinkan pengambilan spesimen dahak yang adekuat), serta mengacu pada prinsip penegakan diagnosis TB (baik pada anak maupun dewasa) dari pedoman Kementerian Kesehatan, langkah diagnostik yang direkomendasikan adalah:\n\n1.  **Pemeriksaan Bakteriologis Awal:**\n    *   Langkah pertama yang paling penting adalah mengupayakan pengambilan spesimen dahak pasien. Pada usia 15 tahun, pasien seharusnya dapat memproduksi dahak yang cukup.\n    *   Dahak tersebut harus diperiksa menggunakan **Tes Cepat Molekuler (TCM) TB** atau **pemeriksaan mikroskopis BTA**. (Sesuai dengan alur diagnosis TB anak pada Gambar 8.1, halaman 103, dan prinsip diagnosis TB paru pada dewasa, halaman 22).\n    *   Pemeriksaan TCM sangat direkomendasikan karena kemampuannya mendeteksi *M. tuberculosis* dan sekaligus resistensi terhadap Rifampisin dengan cepat (halaman 23).\n    *   Jika TCM tidak tersedia atau tidak memungkinkan, pemeriksaan mikroskopis dapat dilakukan (halaman 23).\n    *   Diperlukan minimal 2 (dua) contoh uji dahak dengan kualitas yang bagus untuk pemeriksaan TCM (halaman 23).\n\n2.  **Pemeriksaan Penunjang Lanjutan (Jika Bakteriologis Negatif atau Tidak Memungkinkan):**\n    *   Jika hasil pemeriksaan bakteriologis negatif, atau pasien tidak dapat memproduksi spesimen dahak, atau ada kecurigaan TB ekstra paru, maka pertimbangkan pemeriksaan **Foto Toraks**. (Sesuai pedoman diagnosis TB anak, halaman 93).\n    *   **Penting:** Diagnosis TB tidak dibenarkan hanya berdasarkan pemeriksaan foto toraks saja, karena gambaran TB paru pada foto toraks tidak selalu spesifik (halaman 23).\n    *   Pertimbangkan untuk melakukan **Uji Tuberkulin** (TST), terutama jika hasil bakteriologis negatif dan riwayat kontak tidak jelas. Uji tuberkulin merupakan bagian dari rekomendasi pendekatan diagnosis TB pada anak (halaman 93 dan alur diagnosis TB anak, Gambar 8.1, halaman 103).\n    *   Jika semua pemeriksaan di atas tidak memberikan konfirmasi definitif, gunakan **Sistem Skoring TB Anak** (Gambar 8.1, halaman 103) untuk membantu penilaian klinis lebih lanjut, terutama jika tidak ada riwayat kontak dan pemeriksaan bakteriologis negatif.\n\n### Langkah Selanjutnya\n\n*   **Interpretasi Hasil:**\n    *   Jika hasil pemeriksaan TCM atau mikroskopis BTA positif, pasien dapat dikonfirmasi sebagai kasus TB.\n    *   Jika hasil pemeriksaan bakteriologis negatif atau spesimen tidak dapat diambil/diproduksi, hasil foto toraks, uji tuberkulin, dan sistem skoring perlu dievaluasi secara komprehensif oleh dokter untuk menegakkan diagnosis klinis TB atau mencari penyebab lain dari gejala yang dialami pasien.\n*   **Evaluasi Klinis Menyeluruh:** Sangat penting untuk melakukan evaluasi klinis menyeluruh, termasuk pemeriksaan fisik yang lebih detail, untuk mencari tanda-tanda lain yang mendukung diagnosis TB atau menyingkirkan kemungkinan penyakit lain.\n*   **Rujuk dan Konsultasi:** Pasien harus dievaluasi dan ditangani oleh profesional kesehatan yang kompeten untuk penegakan diagnosis definitif dan perencanaan tatalaksana yang tepat.\n\n---\n\n**Disclaimer:**\nInformasi ini disediakan oleh TBNow, sebuah sistem pendukung keputusan klinis berbasis AI, dan **TIDAK BERTUJUAN** untuk memberikan diagnosis definitif atau menggantikan penilaian klinis seorang profesional kesehatan. Selalu diperlukan evaluasi medis langsung dan konfirmasi diagnostik oleh dokter atau tenaga kesehatan yang berwenang. Keputusan diagnosis dan penatalaksanaan harus selalu didasarkan pada penilaian klinis komprehensif, riwayat pasien, pemeriksaan fisik, dan hasil tes diagnostik yang relevan.",
    "patientInfo": {
      "age": "15",
      "gender": "Male",
      "symptoms": "Batuk batuk",
      "duration": "2 minggu ",
      "contactHistory": "Tidak ada",
      "comorbidities": "Asam lambung",
      "vitalSigns": "39 C, 128/74",
      "physicalExam": "Baik"
    },
    "chatHistory": [],
    "createdAt": "2025-12-17T14:45:32.434325",
    "updatedAt": "2025-12-17T15:05:26.322465"
  },
  {
    "id": "1cbfd9fa-9fa5-44c1-bdee-1982374df55f",
    "patientId": "TB-2025-002",
    "date": "2025-12-17",
    "type": "Patient Diagnosis",
    "status": "follow-up",
    "result": "Analisis X-ray: Risiko TB: High\nTingkat Kepercayaan: 100.0%\nCatatan: Not a diagnosis\nHeatmap: /static/heatmaps/51f463f3-65e0-4aea-8d20-62ac0e01420e.png",
    "patientInfo": {
      "age": "",
      "gender": "",
      "symptoms": "",
      "duration": "",
      "contactHistory": "",
      "comorbidities": "",
      "vitalSigns": "",
      "physicalExam": ""
    },
    "xrayResult": {
      "risk_level": "High",
      "confidence": 1,
      "heatmap_url": "/static/heatmaps/51f463f3-65e0-4aea-8d20-62ac0e01420e.png",
      "note": "Not a diagnosis"
    },
    "chatHistory": [],
    "createdAt": "2025-12-17T15:06:56.677179",
    "updatedAt": "2025-12-17T15:06:56.677179"
  },
  {
    "id": "122e08fa-59b7-4770-a319-b6da98a1ac8b",
    "patientId": "TB-2025-003",
    "date": "2025-12-17",
    "type": "Patient Diagnosis",
    "status": "follow-up",
    "result": "Analisis X-ray: Risiko TB: High\nTingkat Kepercayaan: 100.0%\nCatatan: Not a diagnosis\nHeatmap: /static/heatmaps/39c2444c-379c-4606-999f-47c75175e9c7.png",
    "patientInfo": {
      "age": "",
      "gender": "",
      "symptoms": "",
      "duration": "",
      "contactHistory": "",
      "comorbidities": "",
      "vitalSigns": "",
      "physicalExam": ""
    },
    "xrayResult": {
      "risk_level": "High",
      "confidence": 1,
      "heatmap_url": "/static/heatmaps/39c2444c-379c-4606-999f-47c75175e9c7.png",
      "note": "Not a diagnosis"
    },
    "chatHistory": [],
    "createdAt": "2025-12-17T15:40:10.420955",
    "updatedAt": "2025-12-17T15:40:10.420955"
  },
  {
    "id": "1f278a55-375d-46b4-a5cd-033bd177b1dd",
    "patientId": "TB-2025-004",
    "date": "2025-12-17",
    "type": "Patient Diagnosis",
    "status": "normal",
    "result": "Analisis X-ray: Risiko TB: Low\nTingkat Kepercayaan: 0.0%\nCatatan: Not a diagnosis\nHeatmap: /static/heatmaps/c533a3bc-c588-497a-8e69-c8374f3c24fb.png",
    "patientInfo": {
      "age": "",
      "gender": "",
      "symptoms": "",
      "duration": "",
      "contactHistory": "",
      "comorbidities": "",
      "vitalSigns": "",
      "physicalExam": ""
    },
    "xrayResult": {
      "risk_level": "Low",
      "confidence": 0,
      "heatmap_url": "/static/heatmaps/c533a3bc-c588-497a-8e69-c8374f3c24fb.png",
      "note": "Not a diagnosis"
    },
    "chatHistory": [],
    "createdAt": "2025-12-17T15:40:30.720937",
    "updatedAt": "2025-12-17T15:40:30.720937"
  },
  {
    "id": "1b2dd4f8-73e6-46c5-a1b3-39a8dd11ee3a",
    "patientId": "TB-2025-005",
    "date": "2025-12-17",
    "type": "Patient Diagnosis",
    "status": "follow-up",
    "result": "Halo, saya TBNow, sebuah sistem pendukung keputusan klinis bertenaga AI untuk skrining dan diagnosis Tuberkulosis. Berdasarkan informasi yang Anda berikan, berikut adalah analisis dan rekomendasi:\n\n**Penilaian Risiko & Dukungan Keputusan Klinis TBNow**\n\n**Penilaian:**\nBerdasarkan informasi pasien (laki-laki, 53 tahun) dengan gejala **batuk selama 4 minggu** dan **riwayat kontak erat** dengan pasien TB, serta demam 39°C, terdapat **kecurigaan tinggi terhadap Tuberkulosis**.\n\n*   **Gejala Khas TB:** Batuk yang berlangsung lebih dari dua minggu merupakan salah satu kriteria utama skrining TB, sesuai dengan *International Standard for TB Care (ISTC) Standar 2* yang menyatakan bahwa \"Semua pasien, termasuk anak-anak, dengan batuk yang tidak diketahui penyebabnya yang berlangsung dua minggu atau lebih atau dengan temuan lain pada foto toraks yang tidak diketahui penyebabnya yang mendukung kearah TB harus dievaluasi untuk TB.\"\n*   **Riwayat Kontak:** Adanya riwayat kontak erat dengan pasien TB paru dewasa meningkatkan risiko terpapar dan mengembangkan penyakit TB.\n*   **Demam:** Demam 39°C merupakan tanda infeksi yang signifikan dan dapat menjadi gejala sistemik TB, meskipun tidak spesifik.\n\nMengingat kombinasi gejala batuk kronis, riwayat kontak, dan demam, pasien ini masuk dalam kategori **terduga TB** yang memerlukan evaluasi diagnostik lebih lanjut.\n\n**Rekomendasi Diagnostik:**\nUntuk menegakkan diagnosis TB paru pada orang dewasa, prinsip utamanya adalah konfirmasi bakteriologis. Berdasarkan pedoman:\n\n1.  **Pemeriksaan Bakteriologis (Prioritas Utama):**\n    *   **Tes Cepat Molekuler (TCM) TB MTB/RIF:** Direkomendasikan sebagai pemeriksaan diagnostik awal. *Standar 3a ISTC* menyatakan, \"Semua pasien... yang dicurigai memiliki TB paru dan mampu mengeluarkan dahak, harus memberikan... satu spesimen dahak untuk pemeriksaan TCM TB MTB/RIF dilaboratorium yang sudah teruji kualitasnya.\" TCM memiliki keunggulan dalam mendeteksi *Mycobacterium tuberculosis* dan resistensi Rifampisin secara cepat.\n    *   **Pemeriksaan Mikroskopis Sputum BTA:** Pasien juga dapat memberikan minimal dua spesimen dahak untuk pemeriksaan mikroskopis BTA. (*Standar 3a ISTC*)\n    *   **Biakan (Kultur):** Jika hasil TCM atau mikroskopis negatif namun kecurigaan klinis tetap tinggi, atau jika ada indikasi resistensi obat, pemeriksaan biakan dapat dilakukan.\n\n2.  **Pemeriksaan Penunjang:**\n    *   **Foto Toraks (Rontgen Dada):** Meskipun konfirmasi bakteriologis adalah yang utama, foto toraks dapat memberikan gambaran lesi di paru yang mendukung diagnosis TB dan membantu menilai tingkat keparahan penyakit.\n\n**Langkah Selanjutnya:**\n1.  **Pengambilan Spesimen Dahak:** Segera instruksikan pasien untuk mengumpulkan spesimen dahak (sebaiknya dahak pagi atau dahak sewaktu) untuk pemeriksaan TCM dan/atau mikroskopis BTA. Pastikan kualitas spesimen memadai.\n2.  **Pemeriksaan Foto Toraks:** Lakukan pemeriksaan foto toraks untuk melihat gambaran paru.\n3.  **Evaluasi Klinis Lanjutan:** Kombinasikan hasil pemeriksaan bakteriologis dan foto toraks dengan penilaian klinis secara menyeluruh oleh dokter.\n4.  **Konsultasi Ahli:** Jika diagnosis masih belum jelas atau ada komplikasi, pertimbangkan untuk berkonsultasi dengan dokter spesialis paru atau tim TB.\n\n**Penting (Disclaimer):**\nInformasi yang diberikan oleh TBNow adalah alat pendukung keputusan klinis dan tidak dimaksudkan sebagai diagnosis definitif atau pengganti penilaian klinis profesional. Selalu **rekomendasikan pengujian konfirmasi** dan **evaluasi medis menyeluruh oleh tenaga kesehatan berlisensi** untuk penentuan diagnosis dan rencana tata laksana. TBNow adalah alat AI dan memiliki keterbatasan.\n\n**Sumber:**\n*   Kementerian Kesehatan Republik Indonesia. Pedoman Nasional Pelayanan Kedokteran Tata Laksana Tuberkulosis. (Hal. 16, 22)\n*   International Standards for Tuberculosis Care (ISTC), 3rd Edition. (Standar 2, 3a, 3b)",
    "patientInfo": {
      "age": "53",
      "gender": "Male",
      "symptoms": "Batuk batuk",
      "duration": "4 minggu",
      "contactHistory": "Ada",
      "comorbidities": "Tidak ada",
      "vitalSigns": "140/80, 39 C",
      "physicalExam": "Baik"
    },
    "xrayResult": null,
    "chatHistory": [],
    "createdAt": "2025-12-17T15:42:20.969225",
    "updatedAt": "2025-12-17T15:42:20.969225"
  }
]